tests/reports/load/loc_concurrent_users.txt
tests  (git)-[main]- ➤ pnpm test:load:local

> tests@1.0.0 test:load:local /Users/subhajitgorai/Codes/current_projects/opencanvas/tests
> artillery run load-test.yml -e local

Test run id: tremq_neewzbmncr96a8parn9h8czbeyyg8_dfm9
Phase started: Sustained load (index: 0, duration: 30s) 16:29:24(+0530)

--------------------------------------
Metrics for period to: 16:29:30(+0530) (width: 5.005s)
--------------------------------------

http.codes.200: ................................................................ 51
http.downloaded_bytes: ......................................................... 859656
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 51
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 13
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 13
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 51
vusers.completed: .............................................................. 51
vusers.created: ................................................................ 51
vusers.created_by_name.Fetch educational articles: ............................. 51
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.3
  max: ......................................................................... 39
  mean: ........................................................................ 8.1
  median: ...................................................................... 6.1
  p95: ......................................................................... 15.6
  p99: ......................................................................... 19.1


--------------------------------------
Metrics for period to: 16:29:40(+0530) (width: 9.956s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1685600
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.7
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.7
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Fetch educational articles: ............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 7.8
  mean: ........................................................................ 4.8
  median: ...................................................................... 4.7
  p95: ......................................................................... 6.5
  p99: ......................................................................... 6.8


Phase completed: Sustained load (index: 0, duration: 30s) 16:29:54(+0530)

--------------------------------------
Metrics for period to: 16:29:50(+0530) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 1685600
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 4
  mean: ........................................................................ 2.6
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 4
  mean: ........................................................................ 2.6
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Fetch educational articles: ............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 9
  mean: ........................................................................ 4.8
  median: ...................................................................... 4.8
  p95: ......................................................................... 6.2
  p99: ......................................................................... 7


--------------------------------------
Metrics for period to: 16:30:00(+0530) (width: 4.763s)
--------------------------------------

http.codes.200: ................................................................ 49
http.downloaded_bytes: ......................................................... 825944
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 49
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 4
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 4
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 49
vusers.completed: .............................................................. 49
vusers.created: ................................................................ 49
vusers.created_by_name.Fetch educational articles: ............................. 49
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 6.9
  mean: ........................................................................ 4.1
  median: ...................................................................... 3.9
  p95: ......................................................................... 5.1
  p99: ......................................................................... 5.6


All VUs finished. Total time: 32 seconds

--------------------------------
Summary report @ 16:29:57(+0530)
--------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 5056800
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.7
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.7
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Fetch educational articles: ............................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 39
  mean: ........................................................................ 5.3
  median: ...................................................................... 4.7
  p95: ......................................................................... 7.8
  p99: ......................................................................... 15.6
tests  (git)-[main]- ➤